%% ============================================================
% Kolmogorov大气湍流相位屏生成
% 作者：李申乾
% =============================================================

clc;
clear;
close all;

%% ------------------------
% 参数设置
%% ------------------------

N = 256;          % 相位屏大小
delta = 0.01;     % 采样间隔(m)
r0 = 0.20;        % Fried参数(m)

%% ------------------------
% 建立空间坐标
%% ------------------------

x = (-N/2:N/2-1) * delta;
[X,Y] = meshgrid(x,x);

%% ------------------------
% 建立频率坐标
%% ------------------------

df = 1/(N*delta);

fx = (-N/2:N/2-1)*df;

[FX,FY] = meshgrid(fx,fx);

f = sqrt(FX.^2 + FY.^2);

%% ------------------------
% Kolmogorov功率谱
%% ------------------------

PSD = 0.023 * r0^(-5/3) .* f.^(-11/3);

% 避免中心频率无穷大
PSD(N/2+1,N/2+1) = 0;

%% ------------------------
% 显示PSD
%% ------------------------

figure;

imagesc(log10(PSD+1e-20));

axis image;

colorbar;

title('Kolmogorov PSD');

%% ------------------------
% 生成二维复高斯随机数
%% ------------------------

cn = randn(N) + 1i*randn(N);

%% ------------------------
% 频谱加权
%% ------------------------

phase_fft = cn .* sqrt(PSD);

%% ------------------------
% IFFT得到相位屏
%% ------------------------

phase = real(ifft2(ifftshift(phase_fft)));

%% ------------------------
% 显示相位屏
%% ------------------------

figure;

imagesc(phase);

axis image;

colormap jet;

colorbar;

title('Kolmogorov Phase Screen');



%% ------------------------
% 保存图片
%% ------------------------

saveas(gcf,'PhaseScreen.png');

disp('===========================')
disp('Kolmogorov相位屏生成完成！')
disp('图片已保存为 PhaseScreen.png')
disp('===========================')
%% Kolmogorov大气湍流相位屏
